# Brewfile

# Tap（必要なリポジトリを追加）
tap "homebrew/cask"
tap "homebrew/cask-fonts"  # フォント用のリポジトリ

# パッケージ（brewでインストール）
brew "zsh"       # Zsh
brew "git"       # Git
brew "gh"        # GitHub CLI
brew "starship"  # プロンプト
brew "fzf"       # ファジーファインダー
brew "htop"      # システムモニタリングツール
brew "sheldon"   # zsh プラグインマネージャー
brew "eza"       # `ls`の強化版
brew "bat"       # `cat`の強化版
brew "fd"        # `find`の強化版
brew "rg"        # `grep`の強化版
brew "rustup-init" # Rust

# Caskアプリケーション（brew install --caskでインストール）
cask "cursor"
cask "visual-studio-code"
cask "docker"
cask "google-chrome"
cask "slack"
cask "alt-tab"
cask "raycast"
cask "postman"
cask "rambox"
cask "github-desktop"
cask "iterm2"

# フォント
cask "font-cica"  # Cicaフォント
